def n1():
    n = [1, 2, 3, 4, 5]
    numb = int(input('ввод'))
    if numb in n:
        print("поздравляю, вы угадали число")
    else:
        print("нет такого числа")

def n2():
    n = [1, 1, 2, 3]
    p = {x for x in n if n.count(x) > 1}
    print(p)

def n3():
    a = ["понедельник", "вторник", "среда", "четверг", "пятница", "суббота", "воскресенье"]
    v = int(input("Введите количество выходных"))
    if v == 1:
        print("Выходные: ", a[6])
        print("Рабочие", a[0, 1, 2, 3, 4, 5])
    elif v == 2:
        print("Выходные: ", a[5, 6])
        print(a[0, 1, 2, 3, 4])
    elif v == 3:
        print("Выходные: ", a[4, 5, 6])
        print("Рабочие", a[0, 1, 2, 3])
    elif v == 4:
        print("Выходные: ", a[3, 4, 5, 6])
        print("Рабочие", a[0, 1, 2])
    elif v == 5:
        print("Выходные: ", a[2, 3, 4, 5, 6])
        print("Рабочие", a[0, 1])
    elif v == 6:
        print("Выходные: ", a[1, 2, 3, 4, 5, 6])
        print("Рабочие", a[0])
    elif v == 7:
        print("Выходные: ", a[0, 1, 3, 4, 5, 6])

def n4():
    f1 = ["Иванов", "Сидоров", "Петров", "Водкин", "Кащеев", "Беликова", "Ефлютина", "Аузяк", "Обрывалина", "Ившина"]
    f2 = random.choices(f1, k=5)
    f3 = ["Соколов", "Орлов", "Артемьев", "Леппа", "Абросимова", "Сметанина", "Виноградов", "Рахимов", "Ткач", "Кимыр"]
    f4 = random.choices(f3, k=5)
    f5 = (f2 + f4)
    print(f1, f3, f5)
    dlina = len(f5)
    print(dlina)
    tmp = list(f5)
    tmp.sort()
    f5 = tuple(tmp)
    name = "Иванов"
    if name in f5:
        print("есть")
    else:
        print("нет")

